Конфигурация/InformationRegisters/НазначенияНастроекОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НазначенияНастроекОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаВидаДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НазначенияНастроекОтчетов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Настройка) И (Не ЗначениеЗаполнено(ЭтаФорма.ТекущаяНастройка)
		Или Вопрос("Заполнить применимость настройки значениями по умолчанию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		ЗаполнитьПрименение();
	КонецЕсли; 
	ТекущаяНастройка = Запись.Настройка;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрименение()

	ЗаполнитьЗначенияСвойств(Запись, Запись.Настройка, "НастройкаОтчета, НастройкаКлиента, НастройкаВидаДоговора, НастройкаСчетаДоверительногоУправления, НастройкаПакета");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = Неопределено;
	Если Параметры.Ключ.Пустой() И Параметры.ЗначенияЗаполнения.Свойство("Настройка", Настройка) Тогда
		ЗаполнитьПрименение();
	КонецЕсли; 
	
	// Проверяем, чтобы настройки были только для группы верхнего уровня	
	
	Если ЗначениеЗаполнено(Запись.Отчет)
		И Запись.Отчет.ЭтоГруппа 
		И ЗначениеЗаполнено(Запись.Отчет.Родитель) 
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройки могут быть заданы только для группы отчетов верхнего уровня", , , , Отказ);		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОпопвещения = Новый Структура("Отчет, НастройкаОтчета, НастройкаКлиента, НастройкаВидаДоговора, НастройкаСчетаДоверительногоУправления, НастройкаПакета");
	ЗаполнитьЗначенияСвойств(ПараметрыОпопвещения, Запись);
	Оповестить("ЗаписанаДоступнаяНастройка", ПараметрыОпопвещения);
КонецПроцедуры
